// Дано число больше 9. Вывести на экран вторую цифру числа с конца.
int a=335;
System.Console.WriteLine(a/10%10);
