// Написать программу вычисления значения y= sin(a). (Math).
double a = Convert.ToDouble(Console.ReadLine());
double y = Math.Sin(a);
System.Console.WriteLine(y);
