// Вывести на экран числа от -N до N.
int N=10;
int M=-10;
while(M<=N)
{
     System.Console.Write($" {M} ");
     M=M+1;
}
