// 80. Вывести на экран кодировку символов по ASCII(с 32 до 122)


for(int i =' ';i<='z';i++)
       
  System.Console.WriteLine(((char)i));